Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UndefinedConnector
Revit does not support Undefined connectors. The following have been replaced by the default connector: [Connector Element]

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UnconnectedDevice
Device has an unconnected [Type Name] connector (index = [Index Number]).

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.UnconnectedCircuit
The element has an unconnected circuit on its connector

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingFailed
Sizing failed.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationNoneWarn
Some elements are not sized because the system calculation level is none or performance. You may change the system calculation level to size them again.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationFlowOnlyWarn
Some elements are not sized because the system calculation is flow only. You may change the system calculation level to size them again.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ShapesNotMatch
Shapes do not match. A connection could not be made.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RemoveConnectorLinksWarn
The links between connector [Index] and connector [Index], connector [Index] and connector [Index] are removed.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RemoveConnectorLinkWarn
The link between connector [Index] and connector [Index] is removed.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.RbsNetworkValidityError
The family is connected in a network and can no longer keep the connectivity.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.OpenConnector
The element has an open connector

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsWarning
Connection to a group failed. Modification of elements within a group is not allowed.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsError
Connection to a group failed. Modification of elements within a group is not allowed.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NoSupportKCoefficientTable
"K Coefficient from table" is not supported on connector for the element

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NoLossDefined
No Loss Defined

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NetworkValidityErrorWasDisconnected
The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NetworkValidityError
The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.MultipleNetwork
Elements in [System Name] are not connected in a single physical network due to one or both of the following:\n- There are disconnects in the system's physical network.\n- Elements in the system are connected to more than one physical network.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.MismatchNoAvailableConnector
Cannot add [Element] to System. There is no available connector matching the System Type ([Type Name]) for the System.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.LayoutConnector
[Unassigned System Type] on Connector [Index Number].

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointTypeMismatch
The element has a connector with a fitting joint type mismatch

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointSizeMismatch
The element has a connector with a fitting joint size mismatch

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointShapeMismatch
The element has a connector with a fitting joint shape mismatch

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.JointGenderMismatch
The element has a connector with a fitting joint gender mismatch

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidPowerFactorValue
The value for Power Factor must be between 0 and 1.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidLoadClassificationValue
The load classification parameter cannot be empty. Please select a valid load classification element for the connector parameter and the associated family parameter.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidConnector
The connector is invalid, the size cannot be determined from the connector.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidConnectionRef
The selected fitting has invalid connections and must be deleted to continue.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnPipeWarn
The [Tap] must be attached to pipe.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnPipe
The [Tap] must be attached to pipe.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnDuctWarn
The [Tap] must be attached to duct.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnDuct
The [Tap] must be attached to duct.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ExistsForSelectedElement
Connections already exists for selected element.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsNeedToBeDisconnected
Elements need to be disconnected.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsConnectedToParent
You have selected elements that are connected to a parent object in a System. These elements cannot be removed from the System.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementsAreDisconnected
Elements need to be disconnected.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementHasMultipleConnectors
Revit found one or more elements with multiple connectors. Select each element and then select the connectors to use for the analytical connection.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ElementAssignedToDefaultSystem
At least one connector on the highlighted element is currently assigned to the [Element Name]. In general items shouldn't be assigned to the Default Systems, but should be assigned as equipments or elements of a non-default system. Click the More Info button below for additional information on System Creation.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.DisconnectedElements
Elements are disconnected!

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.AllElementsRemovedFromCircuitGroup
[System] is empty and will be deleted.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.AirTerminalCenterNotAligned
The center of the Air Terminal doesn't align at (0,0,0): align the Air Terminal Center to the Origin Defining Reference Planes could help to solve the problem.

Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures
Failures about Connector.